#年齢階級別人口割合を算出するモジュール

import pandas as pd

#小地域の年齢階級別人口割合を算出
def age_group_ratio(df):
    #秘匿地域を削除
    df = df[df['総数'] != 'X']
    #'-'は0で置換
    df = df.replace('-', '0')
    
    
    #年齢カラムの数値を文字列から数値列に変換
    # 12列目から32列目に該当する部分を取り出して変換を試みる
    cols_to_convert = ['総数', '（再掲）15歳未満', '（再掲）15～64歳', '（再掲）65歳以上']
    df[cols_to_convert] = df[cols_to_convert].astype(int)
    
    
    #年少人口（0～14歳）
    df['年少人口'] = df['（再掲）15歳未満'] / df['総数']
    #生産年齢人口（15～64歳）
    df['生産年齢人口'] = df['（再掲）15～64歳'] / df['総数']
    #老年人口（65歳以上）
    df['老年人口'] = df['（再掲）65歳以上'] / df['総数']
    #0を割ると欠損値になるので0で置換
    df = df.fillna(0)
    
    #カラムを厳選
    df = df[['KEY_CODE', '年少人口', '生産年齢人口', '老年人口']]
    
    return df